      /if not defined(COPYRIGHT_DSPEC)
     H COPYRIGHT('V1.14.1 - 29.08.2019 - mailto:thomas.raddatz@tools400.de')
      /eof
      /endif
     D CRTMSGDS_VERSION...
     D                 C                   '1.14.1'
     D CRTMSGDS_DATE...
     D                 C                   '29.08.2019'
