      /if not defined(COPYRIGHT_DSPEC)
     H COPYRIGHT('V1.15 - 17.01.2021 - mailto:thomas.raddatz@tools400.de')
      /eof
      /endif
     D CRTMSGDS_VERSION...
     D                 C                   '1.15'
     D CRTMSGDS_DATE...
     D                 C                   '17.01.2021'
