      /if not defined(COPYRIGHT_DSPEC)
     H COPYRIGHT('V1.14 - 02.01.2019 - mailto:thomas.raddatz@tools400.de')
      /eof
      /endif
     D CRTMSGDS_VERSION...
     D                 C                   '1.14'
     D CRTMSGDS_DATE...
     D                 C                   '02.01.2019'
